import { ProductVariant } from "../product-variant/productVariantTypes";
/*══════════════════════════════════════════════════════════════════════╗
║ 🧱 BASES 🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱🧱                     ║
╚══════════════════════════════════════════════════════════════════════╝*/

//base con todos los tipos
interface SellDocument {
    _id: string;
    products: ProductVariant[];
    purchase_date: string;
    seller_name: string;
    total_amount: number;
}

//base con las funciones de db-local
interface SellModelInterface extends SellDocument {
  find(query: Partial<SellDocument>): Promise<SellDocument[]>;
  findOne(query: Partial<SellDocument>): Promise<SellDocument | null>;
  save(query?: Partial<SellDocument>, data?: Partial<SellDocument>): Promise<void>;
  delete(query: Partial<SellDocument>): Promise<void>;
}

//base con tipos unknown para los payloads
type SellUnknown = Record<keyof Omit<SellDocument, '_id'>, unknown>;

/*══════════════════════════════════════════════════════════════════════╗
║ ✂️ DERIVADOS ✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️✂️                ║
╚══════════════════════════════════════════════════════════════════════╝*/

/*══════════════════════════════════════════════════════════════════════╗
║ 🗂️ SCHEMA 🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️🗂️                     ║
╚══════════════════════════════════════════════════════════════════════╝*/

export type SellSchemaType = SellDocument;

/*══════════════════════════════════════════════════════════════════════╗
║ 📦 PAYLOAD 📦📦📦📦📦📦📦📦📦📦📦📦📦📦📦📦📦📦📦                     ║
╚══════════════════════════════════════════════════════════════════════╝*/

export type CreateSellPayload = Omit<SellDocument, '_id'>

/*══════════════════════════════════════════════════════════════════════╗
║ 🔗 REQUEST 🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗🔗                     ║
╚══════════════════════════════════════════════════════════════════════╝*/

export type CreateSellRequest = Request<SellParams, unknown, CreateSellPayload>;
