import express from 'express';
import authRoutes from './routes/auth.routes';
import cookieParser from 'cookie-parser';
import { PORT } from './config';
import cors from 'cors';

const app = express();


app.use(cors({
  origin: 'http://localhost:5173', // o '*' para permitir todos
  methods: ['GET', 'POST', 'PUT', 'DELETE'],
  credentials: true // si usás cookies o headers personalizados
}));
app.use(express.json());
app.use(cookieParser());


app.use('/auth', authRoutes);

app.listen(PORT, () => {
    
    // glados_bar.js

    const asciiArt = `
        ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣽⠤⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡞⣷⣽⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡹⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣻⣿⣻⣿⣿⣿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢧⠞⣧⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢯⣟⣾⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣧⠀⣠⣶⣖⣶⣤⡤⣀⡀⠀⠀⠀⠀
        ⠛⢿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣞⣿⣿⡿⢏⠹⣯⠛⠒⠯⣕⡢⣄⠀
        ⠀⠈⠳⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣘⠀⠀⠀⠀⠂⠀⠉⢢⢇
        ⠀⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣵⡀⠀⠀⠀⠀⠀⠀⠈⢿
        ⠀⠀⠀⠀⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⡓⢀⡀⢀⡀⠀⠀⠀⠀⢸
        ⠀⠀⠀⠀⠀⠀⠙⢟⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣟⣟⣿⣿⣟⠿⣿⡷⣭⣿⣿⣿⣿⣿⢲⢦⣿⣷⣶⣦⡄⠀⠀⢀⢸
        ⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠿⣻⣿⣿⠿⠿⣿⣛⠥⠒⠋⠁⠀⠈⠙⠿⣿⣶⣭⣺⢽⣿⣿⣿⣿⢏⣮⣿⣿⣿⣿⣿⣿⡆⠀⡘⡏
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠷⣿⣿⣿⣿⣣⣿⣿⣋⣽⣿⣿⣿⠠⢰⢿⠁
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⢿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣇⠧⣟⡿⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣞⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣎⡿⡿⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡽⠁⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢟⡞⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⢿⣿⣿⣿⣿⣻⠟⢉⠀⠀⠀⠀⠀
        `;

        const frames = [
          '▱▱▱▱▱▱▱▱▱▱ 0%',
          '▰▱▱▱▱▱▱▱▱▱ 10%',
          '▰▰▱▱▱▱▱▱▱▱ 20%',
          '▰▰▰▱▱▱▱▱▱▱ 30%',
          '▰▰▰▰▱▱▱▱▱▱ 40%',
          '▰▰▰▰▰▱▱▱▱▱ 50%',
          '▰▰▰▰▰▰▱▱▱▱ 60%',
          '▰▰▰▰▰▰▰▱▱▱ 70%',
          '▰▰▰▰▰▰▰▰▱▱ 80%',
          '▰▰▰▰▰▰▰▰▰▱ 90%',
          '▰▰▰▰▰▰▰▰▰▰ 100%',
        ];

        
        let i = 0;

        console.clear();
        console.log(asciiArt);
        console.log('💬 GLaDOS: Initializing data stream...');

        setInterval(() => {
          process.stdout.write(`\rFuncionamiento del puerto ${frames[i]} `);
          i = (i + 1) % frames.length;
        }, 10);
                            
        console.log(`Tu código funciona. Por ahora. No te acostumbres`);
        console.log(`El BackEnd de KioscoApp esta funcionando, sorprendentemente, en el puerto numero ${PORT}`);
    
});